{
  "introText": [
    "Welcome to Reflect 2.0\n\nReflect is a tool for history majors at Minot State University.",
    "Use it to review your work, evaluate your mastery of historical skills, and prepare the required reflection statements for your graduation portfolio.",
    "The basic formula is to:\n\n1. fill in a cover sheet\n2. select history papers\n3. write reflections on your mastery of student learning outcomes\n4. rate your mastery of each outcome\n5. preview your reflection as a PDF file\n6. upload the PDF of your reflection to your portfolio",
    "Why a Portfolio?\n\nThe portfolio reveals your growth over the course of the major. It highlights strengths and mastery of the objectives expected at graduation. The portfolio also preserves a compilation of your best work to showcase for graduate school, law school, or interviews. It also lets history faculty assess areas of strength in the program and identify trends to address in future years.",
    "Timely submission of your portfolio is also a graduation requirement, verified by successful completion of HIST 097.  Trust us, the registrar will check before issuing your diploma!",
    "Cover Sheet\n\nPlease fill in your academic and contact information and select your advisor. We ask you to share current and long-term contact info so we can share departmental news, job opportunities, and occasionally seek your advice.",
    "Student Learning Outcomes\n\nThe history program is built around major goals, each which is supported by a series of student learning outcomes. The goal of the portfolio is for the student to use history papers and projects to assess his or her mastery of the program’s expected learning outcomes for all majors.  You assess your portfolio two ways: in paragraphs explaining how you your portfolio shows your level of mastery for each outcome and also by using a rubric to rate your skill on each outcome.",
    "Papers? What Papers?\n\nSelect your SIX best history papers, including:\n 401 Historiography major paper and abstract\n 401 Origins of a contemporary/controversial issue paper\n A Seminar Paper\n Three other 200, 300, or 400-level courses (excluding History 211, 212 and 280).\n Papers should be longer than 5 pages, not shorter response papers or take-home exams. Multimedia projects and posters may also be submitted as portfolio items."
    "How Not to Lose Papers\n\nAll majors receive a free storage space in their OneDrive account.  See your advisor if you need this folder created or instructions. We recommend you upload these papers as you complete them.  We also recommend you invest in multiple backup strategies including back-up USB drives, emailing papers to your MSU email account and retaining paper copies.  When you’ve completed your reflections upload that PDF file to your portfolio.",
    "Random Questions\n\nI’m a transfer student. What about work from other institutions?\n  Because outside work doesn’t help us assess your learning at MSU please only use projects done at MSU.  If you have a fewer papers as a result that’s ok.",
    "When is this due?\n\nThe portfolio is documented through the zero-credit HIST 097 course.  For fall graduates the portfolio should be complete by November 1.  For spring graduates the portfolio is due April 1. "
    "Questions?\n\nPlease do not hesitate to consult any member of the History Department for help and clarifications"
  ],


  "courseAry": [
    "401 Historiography",
    "499 Special Topics",
    "497 Internship",
    "494 Independent Study",
    "491 Seminar",
    "460 Modern France Francophone World",
    "442 Crusades",
    "440 Comparative Slavery Americas",
    "435 Latin America Seminar",
    "434 History and Multimedia",
    "430 Native American Social History",
    "420 Indian People Great Plains",
    "415 20th Century America",
    "410 Trans-Mississippi West",
    "385 Brazil",
    "380 Mexico",
    "365 Peoples and Cultures of Native North America",
    "363 Atlantic History",
    "352 Medieval and Early Modern Women",
    "351 Mediterranean World",
    "350 20th Century Europe",
    "347 Making of Modern Europe",
    "343 Medieval Church",
    "342 Age of the Vikings",
    "338 South Africa",
    "337 Imperialism",
    "336 African American",
    "328 Tranformation of America",
    "325 Sectionalism and Civil War",
    "320 Early Republic",
    "319 Colonial America",
    "315 American Women",
    "299 Special Topics",
    "261 American Indian History",
    "251 Public History",
    "220 North Dakota",
    "not listed"
  ],
  "goalData": {
    "1": {
      "title": "Broad Historical Knowledge",
      "description": "Relate historical content for a variety of periods and places.",
      "guide": "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain.",
      "rating": [
        "Coursework reflects the minimum geographic distribution: at least one EU, US, and NW course. Selected papers/projects are only from one geographic area and deal with similar historical topics.",
        "Coursework reflects the minimum geographic distribution: at least one EU, US, and NW course, with other coursework largely focused on one geographic area. Selected papers/projects are mainly from two geographic areas and deal with similar historical topics.",
        "Coursework and portfolio reflects engagement with US, EU, and NW areas and selected papers/projects are distributed across two or more geographic areas and display several different historical topics.",
        "Coursework and portfolio reflects engagement with US, EU, and NW areas and selected papers/projects are representative of US, EU, and NW areas and display a variety of historical topics."
      ]
    },
    "2": {
      "title": "Chronology and Change",
      "description": "Explain chronology, change, and continuity as they pertain to history.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "Selected papers/projects draw no connections between historical events and/or periods.",
        "Selected papers/projects draw few reasonable and appropriate connections between historical events and/or periods.",
        "Selected papers/projects draw some reasonable and appropriate connections between historical events and/or periods.",
        "Selected papers/projects clearly draw reasonable and appropriate connections between historical events and/or periods."
      ]
    },
    "3": {
      "title": "Assess and Cite Sources",
      "description": "Assess and select relevant historical data from both primary and secondary sources, citing that data accurately using the Chicago/Turabian style guide.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "Papers/projects include one or two secondary sources. Secondary sources are encyclopedic or websites. No inclusion of primary sources.  Citations are absent or inaccurate.",
        "Papers/projects include few primary and secondary sources, i.e, most of the information comes from three or fewer sources. Secondary sources are general in nature. Few primary sources are cited or included. Evidence is minimally cited and/or citations are incomplete or inaccurate.",
        "Papers/projects include some secondary sources and some primary sources. Evidence includes some secondary sources such as historical monographs and research articles and some primary sources such as government documents, newspapers, diaries/memoirs, photographs, annals, chronicles, or literary works in translation. Citations are adequate and mostly accurate.",
        "Papers/projects include and cite correctly many primary and secondary sources. Secondary sources include historical monographs and/or research articles. Primary sources such as government documents, newspapers, diaries/memoirs, photographs, annals, chronicles, or literary works in translation are in evidence.  Citations are abundant and accurate."
      ]
    },
    "4": {
      "title": "Research Historiography",
      "description": "Demonstrate the ability to become informed on historiographical issues through the use of history journals, books, and reviews.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "The paper incorporates fewer than two standard and current journals, books, and reviews in advancing a historiographical study.",
        "The paper incorporates few standard and current journals, books, and reviews in advancing a historiographical study.",
        "The paper incorporates some standard and current journals, books, and reviews in advancing a historiographical study.",
        "The paper incorporates a variety of standard and current journals, books, and reviews in advancing a historiographical study."
      ]
    },
    "5": {
      "title": "Interpret Evidence",
      "description": "Analyze and interpret primary and secondary sources in the service of historical analysis.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "Papers/projects analyze and interpret one or two secondary sources to advance a simple argument. Secondary sources are encyclopedic or websites. No use of primary sources.",
        "Papers/projects analyze and interpret few primary and secondary sources to advance a basic argument, i.e, most of the information comes from three or fewer sources. Secondary sources are general in nature. Few primary sources are cited or used.",
        "Papers/projects analyze and interpret some secondary sources and some primary sources to advance a complex argument. Some secondary sources such as historical monographs and research articles are used. Some primary sources such as government documents, newspapers, diaries/memoirs, photographs, annals, chronicles, or literary works in translation are in evidence.",
        "Papers/projects analyze and interpret a number of primary and secondary sources to advance a sophisticated argument. Secondary sources such as historical monographs and research articles are used. Primary sources such as government documents, newspapers, diaries/memoirs, photographs, annals, chronicles, or literary works in translation are in evidence."
      ]
    },
    "6": {
      "title": "Multiple Perspectives",
      "description": "Employ perspectives such as globalism, multiculturalism, gender, or ethnicity to perform historical analysis.",
      "guide": [
        "Selected papers/projects should cover at least two perspectives. Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "The selected papers/projects do not incorporate such perspectives as globalism, multiculturalism, gender, or ethnicity to analyze a historical problem.",
        "The selected papers/projects minimally incorporate perspectives such as globalism, multiculturalism, gender, or ethnicity, but they are not used to analyze a historical problem.",
        "The selected papers/projects incorporate perspectives such as globalism, multiculturalism, gender or ethnicity to analyze a historical problem.",
        "The selected papers/projects thoroughly incorporate perspectives such as globalism, multiculturalism, gender, or ethnicity to analyze a historical problem and advance an argument."
      ]
    },
    "7": {
      "title": "Analysis and Argument",
      "description": "Demonstrate advanced critical and analytical thinking and writing skills, including the ability to present and support an argumentative thesis.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "The selected paper/product contains neither an argumentative thesis nor analysis based on evidence.",
        "The selected paper/product contains an implied argumentative thesis and some analysis based on evidence.",
        "The selected paper/product contains an argumentative thesis explained over two or more sentences and analysis based on evidence.",
        "The selected paper/product contains a clear argumentative thesis (one sentence) and sophisticated analysis based on evidence."
      ]
    },
    "8": {
      "title": "ND History",
      "description": "Demonstrate knowledge of North Dakota history.",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "The selected paper/product evidences little understanding of North Dakota history.",
        "The selected paper/product analyzes some aspect of North Dakota history in a limited fashion.",
        "The selected paper/product analyzes some aspect of North Dakota history in a solid fashion.",
        "The selected paper/product analyzes some aspect of North Dakota history in a sophisticated fashion."
      ]
    },
    "9": {
      "title": "Controversy and History",
      "description": "Explain the relationship of the past to the present, especially when addressing controversial issues. ",
      "guide": [
        "Which papers/projects offer evidence of your mastery this outcome? How does this evidence demonstrate this outcome? Do you believe you have achieved this outcome more fully than the selected papers demosntrate? Explain."
      ],
      "rating": [
        "The selected paper/product provides little historical context for a controversial issue.",
        "The selected paper/product provides a limited analysis of a controversial issue and its historical context. Relations between the past and the present are not fully drawn out.",
        "The selected paper/product shows some analysis of a controversial issue and its historical context, showing some ways how the past and present interact.",
        "The selected paper/product analyzes a controversial issue in historical context, showing how the past and present interact."
      ]
    }
  }
}
